---
kind: other
id: Methods.T:Autodesk.Revit.DB.BooleanOperationsUtils
source: html/f1fbbe12-bd8f-d29f-bfac-81a56bfa2e76.htm
---
# BooleanOperationsUtils Methods

Creates a new Solid which is the intersection of the input Solid with the half-space on the positive side of the given Plane. The positive side of the plane is the side to which Plane.Normal points.